## Terraform PLAN outputs

<details><summary>infra/s4</summary>

```

[command]/home/ubuntu/actions-runner/_work/_temp/f37bd8a6-7b8a-4199-a06d-333723ea787f/terraform-bin plan -input=false -no-color
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.b will be created
  + resource "aws_s3_bucket" "b" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-tf-test-bucket1werwer"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dsfsadfDev"
          + "Name"        = "My bucket"
        }
      + tags_all                    = {
          + "Environment" = "dsfsadfDev"
          + "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

::debug::Terraform exited with code 0.
::debug::stdout: Refreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_bucket.b will be created%0A  + resource "aws_s3_bucket" "b" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = "private"%0A      + arn                         = (known after apply)%0A      + bucket                      = "my-tf-test-bucket1werwer"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "dsfsadfDev"%0A          + "Name"        = "My bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "dsfsadfDev"%0A          + "Name"        = "My bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A------------------------------------------------------------------------%0A%0ANote: You didn't specify an "-out" parameter to save this plan, so Terraform%0Acan't guarantee that exactly these actions will be performed if%0A"terraform apply" is subsequently run.%0A%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Refreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_bucket.b will be created%0A  + resource "aws_s3_bucket" "b" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = "private"%0A      + arn                         = (known after apply)%0A      + bucket                      = "my-tf-test-bucket1werwer"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "dsfsadfDev"%0A          + "Name"        = "My bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "dsfsadfDev"%0A          + "Name"        = "My bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A------------------------------------------------------------------------%0A%0ANote: You didn't specify an "-out" parameter to save this plan, so Terraform%0Acan't guarantee that exactly these actions will be performed if%0A"terraform apply" is subsequently run.%0A%0A
::set-output name=stderr::
::set-output name=exitcode::0

```

</details>



*Pusher: @lokeshjawane, Action: `pull_request`, Working Directory: ``, Workflow: `Create terraform plan`*